app/controllers/tickets_controller.rb

  def create
    @ticket = Ticket.new(ticket_params)
    @ticket.user_id = current_user.id

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("name", "address", "price", "email_address", "seat_id_seq", "created_at", "updated_at", "phone", "event_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def correct_user
      @ticket = current_user.tickets.find_by(id: params[:id])
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND "tickets"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]